src/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Пол</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Национальность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УченаяСтепень</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УченаяСтепень</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УченоеЗвание</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УченоеЗвание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтношениеКВоеннойСлужбе</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтношениеКВоеннойСлужбе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состав</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РодВойск</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>127</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресФактическогоПроживания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>511</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияПаспорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПаспорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСНИЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаСтепени</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>511</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаОПрисвоенииЗвания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>511</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортКогдаВыдан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятНаРаботу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласиеНаОбработкуПД</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СогласиеНаОбработкуПерсональныхДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательствоСоблюденияРКПД</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбязательствоСоблюденияРКПД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностнаяИнструкция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ДолжностнаяИнструкция</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТрудовойДоговор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТрудовойДоговор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриказОПриеме</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Приказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АкадемЭтикаОзнакомлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СведенияОСемье</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтепеньРодства</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтепеньРодства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРождения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокМестРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МесяцИГодПоступления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцИГодУхода</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеОрганизации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресОрганизации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Образование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименовниеУЗ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресУЗ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФакультетИлиОтделение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГодПоступления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГодОкончанияИлиУхода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсПриОкончанииИлиУходе</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Специальность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияДипломаУдостоверения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДипломаУдостоверения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокНаучныхТрудовИИзобретений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименовниеИздания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаИздания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СписокНаучныхТрудовФормаИздания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияИздания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СписокНаучныхТрудовКатегорияИздания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыходныеДанные</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>512</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Соавторы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>512</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрочиеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/УченаяСтепень.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>УченаяСтепень</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КандидатНаук</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокторНаук</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/УченоеЗвание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>УченоеЗвание</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доцент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Профессор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Сотрудники/Forms/ФормаЭлементаДляСотрудника/Ext/Form/Module.bsl
#Область ОбработчикиСобытий
&НаКлиенте
Процедура КнопкаСохранитьИзменения(Команда)
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаСохранитьИЗакрыть(Команда)
	Записать();
	Закрыть();
КонецПроцедуры

&НаСервере
Функция ПолучитьИнициалыНаСервере(ПолноеИмя)
	Возврат ОбщиеФункцииПроцедуры.ПолучитьФиоСИнициалами(Объект.ПолноеИмя);	
КонецФункции

&НаКлиенте
Процедура ПолноеИмяПриИзменении(Элемент)
	Объект.Наименование = ПолучитьИнициалыНаСервере(Объект.ПолноеИмя);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(СсылкаНаКартинку)  Тогда 
		ФайлКартинки = ПолучитьИзВременногоХранилища(СсылкаНаКартинку); 
		
		ТекущийОбъект.Фотография = Новый ХранилищеЗначения(ФайлКартинки); 
		
		УдалитьИзВременногоХранилища(СсылкаНаКартинку); 
		
		СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Фотография");
	КонецЕсли;
КонецПроцедуры

#Область ОграничениеДоступа
&НаСервере
Функция ПользовательИмеетДоступКЭтойЗаписи()
	Если УправлениеУчетнымиЗаписями.ЭтоАдминистратор(ПараметрыСеанса.ИмяПользователя) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Не ПараметрыСеанса.ИмяПользователя = Объект.ИмяПользователя Тогда                 
		Сообщить("Вы не можете формировать и подписывать документы за других пользователей.");
		Возврат Ложь;	
	КонецЕсли;
	
	Возврат Истина;
КонецФункции
#КонецОбласти

&НаСервере
Процедура ОбновитьСсылки()
	Если Не СсылкаСуществует(Объект.СогласиеНаОбработкуПД) Тогда
		Объект.СогласиеНаОбработкуПД = Документы.СогласиеНаОбработкуПерсональныхДанных.ПустаяСсылка();
	КонецЕсли;
	
	Если Не СсылкаСуществует(Объект.ОбязательствоСоблюденияРКПД) Тогда
		Объект.ОбязательствоСоблюденияРКПД = Документы.ОбязательствоСоблюденияРКПД.ПустаяСсылка();
	КонецЕсли;
	
	Если Не СсылкаСуществует(Объект.ДолжностнаяИнструкция) Тогда
		Объект.ДолжностнаяИнструкция = Документы.ДолжностнаяИнструкция.ПустаяСсылка();	
	КонецЕсли;

	Если Не СсылкаСуществует(Объект.ТрудовойДоговор) Тогда
		Объект.ТрудовойДоговор = Документы.ТрудовойДоговор.ПустаяСсылка();	
	КонецЕсли;
	
	Если Не СсылкаСуществует(Объект.ПриказОПриеме) Тогда
		Объект.ПриказОПриеме = Документы.Приказ.ПустаяСсылка();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Фотография");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)		
	ПриОткрытииНаСервере();
	ОбновитьСсылки();
	ОбновитьДоступностьГиперссылок();
КонецПроцедуры

#Область РаботаСФотографией
&НаКлиенте
Процедура ФотоГиперссылкаНажатие(Элемент)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.ПолноеИмяФайла = ""; 
	
	Фильтр = "Файл Jpg (*.jpg)|*.jpg"; 
	
	ДиалогОткрытия.Фильтр = Фильтр; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберете файл для загрузки"; 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиФайла",ЭтаФорма); 
	
	ДиалогОткрытия.Показать(ОписаниеОповещения);	
КонецПроцедуры       

&НаКлиенте
Процедура ПослеЗагрузкиФайла(ВыбранныйФайл, ДополнительныйПараметр) Экспорт
	Если ВыбранныйФайл = Неопределено Тогда 
		Возврат; 
	КонецЕсли;     
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПомещенияФайла", ЭтаФорма); 
	НачатьПомещениеФайла(ОписаниеОповещения,, ВыбранныйФайл[0], Ложь, УникальныйИдентификатор); 
КонецПроцедуры                                              

&НаКлиенте
Процедура ПослеПомещенияФайла(Результат, Адрес, ВыбранноеИмяФайла, ДопнительныеПараметры) Экспорт
	Если Не Результат Тогда 
		Возврат; 
	КонецЕсли; 
	
	СсылкаНаКартинку = Адрес; 
	Модифицированность = Истина; 
КонецПроцедуры
#КонецОбласти              

&НаСервере
Функция ПолучитьСсылкуНаАкадемЭтику()
	Возврат Константы.СсылкаНаАкадемическуюЭтику.Получить();
КонецФункции

&НаКлиенте
Процедура ДекорацияАкадемЭтикаСсылкаНажатие(Элемент)
	ЗапуститьПриложение(ПолучитьСсылкуНаАкадемЭтику());
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.УченаяСтепень <> ПредопределенноеЗначение("Перечисление.УченаяСтепень.Нет")
	   И Объект.НомерДокументаСтепени = "" Тогда
		ПоказатьПредупреждение( , "Вы не указали номер документа о присвоении ученой степени.",
								, "Вы кое-что забыли!");
		Объект.Заполнен = Ложь;						
		Отказ = Истина;
		Возврат;
	КонецЕсли;  
	
	Если Объект.УченоеЗвание <> ПредопределенноеЗначение("Перечисление.УченоеЗвание.Нет")
	   И Объект.НомерДокументаОПрисвоенииЗвания = "" Тогда
		ПоказатьПредупреждение( , "Вы не указали номер документа о присвоении ученого звания.",
								, "Вы кое-что забыли!");
		Объект.Заполнен = Ложь;						
		Отказ = Истина;
		Возврат;
	КонецЕсли;  
	
	
	Если Не Объект.АкадемЭтикаОзнакомлен Тогда
		ПоказатьПредупреждение( , "Вы не ознакомились с академической этикой Горного университета (вкладка 'Научная деятельность').", 
								, "Вы кое-что забыли!");  
		Объект.Заполнен = Ложь;						
		Отказ = Истина; 
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СсылкаСуществует(Ссылка)
	Возврат Не Ссылка.Пустая() И Не Ссылка.ПолучитьОбъект() = Неопределено;
КонецФункции

&НаСервере
Процедура ОбновитьДоступностьГиперссылок()
	Элементы.СформироватьСогласие.Доступность              = Не СсылкаСуществует(Объект.СогласиеНаОбработкуПД)
														 Или Не Объект.СогласиеНаОбработкуПД.Подписан;	
														 
	Элементы.СформироватьОбязательство.Доступность         = Не СсылкаСуществует(Объект.ОбязательствоСоблюденияРКПД)
														 Или Не Объект.ОбязательствоСоблюденияРКПД.Подписан;
														 
	Элементы.СформироватьДолжностнуюИнструкцию.Доступность = Не СсылкаСуществует(Объект.ДолжностнаяИнструкция)
														 Или Не Объект.ДолжностнаяИнструкция.Подписан;
														 
	Элементы.ПосмотретьДоговор.Доступность                 =    СсылкаСуществует(Объект.ТрудовойДоговор) 
														   И Не Объект.ТрудовойДоговор.Подписан;
КонецПроцедуры

#Область СформироватьДокумент
&НаКлиенте
Функция ПолучитьПараметрыФормы(СсылкаНаДокумент)

КонецФункции

&НаКлиенте
Функция Заполнен()
	Если Не Объект.Заполнен Тогда
		Сообщить("Вы не заполнили данные до конца. Проверьте, пожалуйста, все ли обязательные поля содержат данные.");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура СформироватьСогласиеНажатие(Элемент)
	Если Не ПользовательИмеетДоступКЭтойЗаписи() Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	Если Не Заполнен() Тогда
		Возврат;
	КонецЕсли;
	
    СсылкаНаДокумент = Объект.СогласиеНаОбработкуПД;
	
	Если СсылкаСуществует(СсылкаНаДокумент) Тогда
		ПараметрыФормы = Новый Структура("Ключ", СсылкаНаДокумент);	
	Иначе
		ПараметрыФормы = Новый Структура("СубъектПерсональныхДанных", Объект.Ссылка);
	КонецЕсли;
	
	ОткрытьФорму("Документ.СогласиеНаОбработкуПерсональныхДанных.Форма.ФормаДокументаДляСотрудника", ПараметрыФормы);
	ОбновитьДоступностьГиперссылок();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОбязательствоНажатие(Элемент)  
	Если Не ПользовательИмеетДоступКЭтойЗаписи() Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	Если Не Заполнен() Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаДокумент = Объект.ОбязательствоСоблюденияРКПД;
	
	Если СсылкаСуществует(СсылкаНаДокумент) Тогда
		ПараметрыФормы = Новый Структура("Ключ", СсылкаНаДокумент);	
	Иначе
		ПараметрыФормы = Новый Структура("Подписант", Объект.Ссылка);
	КонецЕсли;
	
	ОткрытьФорму("Документ.ОбязательствоСоблюденияРКПД.Форма.ФормаДокументаДляСотрудника", ПараметрыФормы);
	ОбновитьДоступностьГиперссылок();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДолжностнуюИнструкциюНажатие(Элемент)
	Если Не ПользовательИмеетДоступКЭтойЗаписи() Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
    Если Не Заполнен() Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаДокумент = Объект.ДолжностнаяИнструкция;
	
	Если СсылкаСуществует(СсылкаНаДокумент) Тогда
		ПараметрыФормы = Новый Структура("Ключ", СсылкаНаДокумент);	
	Иначе
		ПараметрыФормы = Новый Структура("Подписант", Объект.Ссылка);
	КонецЕсли;
	
	ОткрытьФорму("Документ.ДолжностнаяИнструкция.Форма.ФормаДокументаДляСотрудника", ПараметрыФормы);
	ОбновитьДоступностьГиперссылок();
	Закрыть();
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура ПосмотретьДоговорНажатие(Элемент)
	Если Не ПользовательИмеетДоступКЭтойЗаписи() Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	СсылкаНаДокумент = Объект.ТрудовойДоговор;
	
	Если Не СсылкаСуществует(СсылкаНаДокумент) Тогда
		Возврат;
	КонецЕсли;
		
	ПараметрыФормы = Новый Структура("Ключ", СсылкаНаДокумент);
	ОткрытьФорму("Документ.ТрудовойДоговор.Форма.ФормаДокументаДляСотрудника", ПараметрыФормы);
	ОбновитьДоступностьГиперссылок();
	
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьПриказНажатие(Элемент)
	Если Не ПользовательИмеетДоступКЭтойЗаписи() Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	СсылкаНаДокумент = Объект.ПриказОПриеме;
	
	Если Не СсылкаСуществует(СсылкаНаДокумент) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", СсылкаНаДокумент);
	ОткрытьФорму("Документ.Приказ.Форма.ФормаДокументаДляСотрудника", ПараметрыФормы);
	ОбновитьДоступностьГиперссылок();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОбновить(Команда)  
	ОбновитьСсылки();
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Объект.Заполнен = Истина;
КонецПроцедуры

#КонецОбласти
